banyanshade-software/train_ctl_sw/trainctl/stm32/ina3221/ina3221.c
/*
 * ina3221.c
 *
 *  Created on: Apr 13, 2021
 *      Author: danielbraun
 */

#include "../../misc.h"





#if defined(STM32F4)
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_gpio.h"

#elif defined(STM32G4)
#include "stm32g4xx_hal.h"
#include "stm32g4xx_hal_gpio.h"

#elif defined(STM32F1)
#include "stm32f1xx_hal.h"
#include "stm32f1xx_hal_gpio.h"

#else
#error no board hal
#endif


#include "cmsis_os.h"

#include "ina3221.h"
#include "ina3221_def.h"
#include "ina3221_config.h"
//#include "utils/microsec.h"

#include "../../msg/trainmsg.h"
#include "../../oscillo/oscillo.h"
#include "../../statval.h"

#include "../../ctrl_detect/train_detectors_params.h"


#ifndef BOARD_HAS_INA3221
#error BOARD_HAS_INA3221 not defined, remove this file from build
#endif


// ----------------------------------------------------------------------------------
// global run mode, each tasklet implement this
static runmode_t run_mode = 0;
static uint8_t testerAddr;

// ----------------------------------------------------------------------------------


uint8_t ina3221_devices[4] = {0, 0, 0, 0};  // 1 if device is present

uint16_t ina3221_errors = 0;
static uint8_t disable_ina3221 = 0;
static int ina3221_init_done = 0;
static int ina_conf_val = 0;

static int16_t ina_svalues[INA3221_NUM_VALS] = {0}; // byteswapped values




const stat_val_t statval_ina3221[] = {
	    { ina_svalues, 0, 2       _P("ina0")},
	    { ina_svalues, 2, 2       _P("ina1")},
	    { ina_svalues, 4, 2       _P("ina2")},
	    { NULL, 0, 0 _P(NULL)}
};

#ifndef INA3221_TASKRD
#error hu?
#endif



static void bkpoint(int loc, int err)
{
	itm_debug2(DBG_ERR|DBG_INA3221, "INA ERR", loc, err);
#ifdef BOARD_HAS_OSCILLO
	extern volatile int oscillo_trigger_start;
	oscillo_trigger_start = 200;
#endif
}


static int ina3221_write16(int a, int reg, uint16_t v);
static uint16_t ina3221_read16(int a, int reg);

static void ina3221_init_and_configure(void);
static void start_detectfreq_read(void);

// ----------------------------------------------------------------------------------




extern osThreadId ina3221_taskHandle;
static int lastErr = 0;
//static int cvrf_dev = 0;

typedef enum {
	state_idle,

	state_trig_0,
	state_trig_1,
	state_trig_2,
	state_trig_3,

	state_rd_0,
	state_rd_1,
	state_rd_2,
	state_rd_3,
	state_rd_4,
	state_rd_5,
	state_rd_6,
	state_rd_7,
	state_rd_8,
	state_rd_9,
	state_rd_10,
	state_rd_11,

} ina_state_t;

//static int _trig(int dev);
static void _reg_read(int dev, int reg);
static void _read_complete(int err);
static int _next_dev(int d);


static void handle_ina_notif_normal(uint32_t notif);
static void handle_ina_notif_detectfreq(uint32_t notif);
static void run_ina_task(void);

//static volatile uint16_t mask_en_val = 0;
static 	ina_state_t state = state_idle;

volatile int16_t oscillo_ina0;
volatile int16_t oscillo_ina1;
volatile int16_t oscillo_ina2;

static uint16_t detect2_bitfield = 0;
static uint16_t detect2_mode = 0;

static int8_t presence[INA3221_NUM_VALS] = {0};



static int singledev = -1;
static int singlech = -1;


void ina3221_task_start(_UNUSED_ void *argument)
{
	if (DISABLE_INA3221) {
		for(;;) {
			osDelay(1);
		}
	}
	run_ina_task();
	itm_debug1(DBG_ERR, "impossible", 0);
}

void brklong(int32_t l)
{
	itm_debug1(DBG_ERR, "long notif", l);
}



static void run_ina_task(void)
{
	ina3221_init_and_configure(); //XXX
	_UNUSED_ int nstuck = 0;
	for (;;) {
		uint32_t notif = 0;
		xTaskNotifyWait(0, 0xFFFFFFFF, &notif, portMAX_DELAY);
		if ((0)) itm_debug1(DBG_INA3221|DBG_DETECT, "ina---", notif);
		uint32_t t0 = HAL_GetTick();

		switch(run_mode) {
		default: // FALLTHRU
		case runmode_normal:
			handle_ina_notif_normal(notif);
			break;
		case runmode_detect2:
			switch (detect2_mode) {
			default: // FALLTHRY
			case 1:
				handle_ina_notif_normal(notif);
				break;
			case 2:
				handle_ina_notif_detectfreq(notif);
				break;
			}
		}
		uint32_t t1 = HAL_GetTick();
		if ((t1-t0) > 3) {
			brklong(t1-t0);
		}
		for (;;) {
			msg_64_t m;
			int rc = mqf_read_to_ina3221(&m);
			if (rc) break;
			switch (m.cmd) {
			case CMD_RESET:
				// FALLTHRU
			case CMD_EMERGENCY_STOP:
				// TODO
				continue;
				break;
			case CMD_SETRUN_MODE:
				if (run_mode != m.v1u) {
					if ((m.v1u == runmode_normal) && (run_mode==runmode_detect2)) {
						itm_debug1(DBG_DETECT, "brk here", 0);
						//p -elements unlimited -- timeval
					}
					run_mode = m.v1u;
					itm_debug1(DBG_INA3221|DBG_DETECT, "INA:mode", run_mode);
					testerAddr = m.from;
					memset(presence, 0, sizeof(presence));
					// reconf on mode change
					ina3221_init_and_configure();
					itm_debug1(DBG_INA3221|DBG_DETECT, "INA:cnfok", run_mode);
				}
				continue;
				break;
			case CMD_START_INA_MONITOR:
				if (run_mode != runmode_detect2) {
					itm_debug1(DBG_ERR|DBG_INA3221, "bad rmode", run_mode);
					continue;
				}
				memset(presence, 0, sizeof(presence));
				itm_debug2(DBG_DETECT|DBG_INA3221, "detect2 ina", m.va16, m.vb8);
				detect2_bitfield = m.va16;
				detect2_mode = m.vb8;
				if (detect2_mode == 2) {
					// frequency mode
					start_detectfreq_read();
				}
				continue;
			default:
				//itm_debug2(DBG_INA3221|DBG_DETECT, "unk msg", m.cmd, run_mode);
				break;
			}
		}
	}
}

static void handle_ina_notif_normal(uint32_t notif)
{
	//int rc;
	if (notif & NOTIF_INA_TRIG) {
		// just ignore (INA3221_CONTIUNOUS)
	}
	if (notif & NOTIF_INA_WRCOMPL) {
		/*
		itm_debug1(DBG_INA3221, "WRcpl", state);
		if ((state >= state_trig_0) && (state <= state_trig_3)) {
			int dev = state - state_trig_0;
			dev = _next_dev(dev);
			if (dev >= 0) {
				state = dev + state_trig_0;
				rc = _trig(dev);
				if (rc) {
					state = state_idle;
					return;
				}
			} else {
				state = state_idle;
			}
		} else {
			bkpoint(1,1000);
		}
		*/
	}
	if (notif & NOTIF_INA_READ) {
		/*
		 * NOTIF_INA_READ is set by TIM1 interrupt
		 * it triggers reading all INA devices (and all channels on each device)
		 */
		if ((1)) itm_debug1(DBG_INA3221, "INA:N:RD", notif);
		int dev = _next_dev(-1);
		if (dev >= 0) {
			state = state_rd_0 + dev * 3;
			_reg_read(dev, 0);
		} else {
			_read_complete(0);
			state = state_idle;
		}
	}
	if (notif & NOTIF_INA_RDCOMPL) {
		itm_debug1(DBG_INA3221, "INA:N:CPL", state);

		if ((state >= state_rd_0) && (state <= state_rd_11)) {
			int reg = (state - state_rd_0) % 3;
			int dev = (state - state_rd_0) / 3;
			if (reg==2){
				dev = _next_dev(dev);
				if (dev >= 0) {
					// state = (state_rd_0 + dev) * 3; oups !!!
					state = state_rd_0 + dev * 3;
					_reg_read(dev, 0);
				} else {
					_read_complete(0);
					state = state_idle;
				}
			} else {
				state++;
				_reg_read(dev, reg+1);
			}
		} else {
			bkpoint(2,1000);
		}
	}
	if (notif & NOTIF_INA_ERR) {
		bkpoint(3, lastErr);
		if ((state >= state_rd_0) && (state <= state_rd_11)) {
			// write error
			// TODO
			state = state_idle;
		} else if ((state >= state_trig_0) && (state <= state_trig_3)) {
			// read error
			// TODO
			state = state_idle;
		} else {
			bkpoint(3,1000);
		}
		itm_debug1(DBG_INA3221|DBG_ERR, "i2c rst", lastErr);
		HAL_I2C_Init(&INA3221_I2C_PORT);
	}
}



// ---------------------------------------------------------------------------

static void _ina3221_configure(int a, int continuous)
{
	//HAL_StatusTypeDef status;
	uint16_t w16;

    _UNUSED_ uint16_t mid = ina3221_read16(a, INA3221_REG_MANUFACTURER_ID);
     // 0x5449
    _UNUSED_ uint16_t did = ina3221_read16(a,  INA3221_REG_DIE_ID);
    // 0x3220

    _UNUSED_ uint16_t cnfbr = ina3221_read16(a,  INA3221_REG_CONFIG);

    if ((1)) {
    	w16 = INA3221_CONF_RESET;
    	int rc = ina3221_write16(a, INA3221_REG_CONFIG, w16);
    	if (rc) {
    		bkpoint(100,rc);
    	}
    	osDelay(50);
    	//if ((1)) return;
    }
    _UNUSED_ uint16_t cnfar = ina3221_read16(a,  INA3221_REG_CONFIG);


    const int usealrm = 0;
    // by setting MODE_SHUNT and configuring CH1_CRIT_LIM, we can
    // use the "critical" led, which will twinckle e.g. to identify physical module

