banyanshade-software/train_ctl_sw/trainctl/stm32/ina3221/ina3221.c
    if ((!usealrm)) {
    	w16 = INA3221_CONF_CH1_EN | INA3221_CONF_CH2_EN | INA3221_CONF_CH3_EN
    		| INA3221_CONF_VS_CT_140u
			| INA3221_CONF_MODE_SHUNT;
    } else {
    	w16 = INA3221_CONF_CH1_EN | INA3221_CONF_CH2_EN | INA3221_CONF_CH3_EN
    		| INA3221_CONF_VS_CT_140u
			| INA3221_CONF_MODE_SHUNT
			| INA3221_CONF_MODE_BUSV
			;
    }
    w16 |= (continuous ? INA3221_CONF_AVG16 : INA3221_CONF_AVG1);

    if (continuous) w16 |= INA3221_CONF_MODE_CONTINUOUS;
	ina_conf_val = w16;
	int rc = ina3221_write16(a, INA3221_REG_CONFIG, w16);
    if ((0)) osDelay(100*1);

    if ((usealrm)) {
    	ina3221_write16(a, INA3221_REG_CH1_CRIT_LIM, 1);
    }

    if (rc) bkpoint(101, rc);
    rc = ina3221_write16(a, INA3221_REG_MASK_ENABLE, 0);
    if (rc) bkpoint(102, rc);

    _UNUSED_ uint16_t cnfac = ina3221_read16(a,  INA3221_REG_CONFIG);


}

void _ina3221_init(int continuous)
{
	if (disable_ina3221) return;
	singledev = -1;
	singlech = -1;
	//I2C_Scan();
	for (int dev = 0; dev<4; dev++) {
		int addr = 0x40 + dev;
	    HAL_StatusTypeDef res;
        res = HAL_I2C_IsDeviceReady(&INA3221_I2C_PORT, addr << 1, 1, 10);
        if (res == HAL_OK) {

        	_ina3221_configure(addr, continuous);

        	itm_debug2(DBG_PRES|DBG_INA3221, "INA@", dev, addr); // 0x40 0x43
        	ina3221_devices[dev]=1;
        } else {
        	ina3221_devices[dev]=0;
        }
	}
	ina3221_init_done = 1;

	/*if ((0)) {
		for (;;) {
			for (int dev=0; dev<4; dev++) {
				if (!ina3221_devices[dev]) continue;
				osDelay(500);
				int addr = 0x40 + dev;
				uint16_t me = ina3221_read16(addr,  INA3221_REG_MASK_ENABLE);
				itm_debug2(DBG_INA3221, "me", dev, me);
			}
		}
	}*/
}

static void ina3221_init_and_configure(void)
{
	_ina3221_init(INA3221_CONTIUNOUS);
}

// ----------------------------------------------------------------------------------


static uint16_t ina_uvalues[INA3221_NUM_VALS] = {0}; // raw values

static int _next_dev(int dev)
{
	if (singledev != -1) {
		return singledev;
	}
	dev = dev+1;
	for (;dev<=3;dev++) {
		if (ina3221_devices[dev]) return dev;
	}
	return -1;
}

/*
static int  _trig(int dev)
{
	if (disable_ina3221) return 0;
	cvrf_dev = dev;
	int addr = 0x40 + dev;
	itm_debug2(DBG_INA3221, "TRIG", dev, addr);
	return ina3221_write16it(addr, INA3221_REG_CONFIG, ina_conf_val);
}
*/

static void _reg_read(int dev, int nreg)
{
	int addr = 0x40 + dev;
	int hwreg;
	switch (nreg) {
	case 0: hwreg = INA3221_REG_CH1_SHUNTVOLT; break;
	case 1: hwreg = INA3221_REG_CH2_SHUNTVOLT; break;
	case 2: hwreg = INA3221_REG_CH3_SHUNTVOLT; break;
	default:
		itm_debug1(DBG_ERR|DBG_INA3221, "hu?", nreg);
		return;
	}
	itm_debug3(DBG_INA3221, "gns read", dev, nreg, hwreg);
	HAL_StatusTypeDef status;

	if (__HAL_I2C_GET_FLAG(&INA3221_I2C_PORT, I2C_FLAG_BUSY) != RESET) {
		itm_debug2(DBG_ERR|DBG_INA3221, "busy", dev, nreg);
		// TODO _end_next_reg(1);
		/*
		 * if this happens systematically, including on first read : check that i2c IRQ
		 * are enabled !
		 */
		return;
	}

	status = HAL_I2C_Mem_Read_IT(&INA3221_I2C_PORT, addr<<1, hwreg, I2C_MEMADD_SIZE_8BIT,
			(uint8_t *)&ina_uvalues[dev*3+nreg], 2);
	if (status != HAL_OK) {
		itm_debug1(DBG_INA3221|DBG_ERR, "readit", status);
		// TODO
		return;
	}
}



static void _read_complete(_UNUSED_ int err)
{
	itm_debug1(DBG_INA3221, "rd:cpl", 0);
	for (int i = 0; i<INA3221_NUM_VALS; i++) {
		ina_svalues[i] = (int16_t) __builtin_bswap16(ina_uvalues[i]);
	}
	msg_64_t m = {0};

	oscillo_ina0 = ina_svalues[0];
	oscillo_ina1 = ina_svalues[1];
	oscillo_ina2 = ina_svalues[2];

	switch (run_mode) {
	default:
		break;
	case runmode_detect_experiment:
		itm_debug1(DBG_INA3221, "D/1", ina_svalues[1]);
		m.from =  MA0_INA(oam_localBoardNum());
		m.to = MA3_UI_GEN;
		m.cmd = CMD_INA3221_VAL1;
		m.subc = 1;
		m.v1 = ina_svalues[1];
		mqf_write_from_ina3221(&m);
		break;


	case runmode_detect2:
		//itm_debug1(DBG_DETECT, "rdcplD", detect2_monitor);
		switch (detect2_mode) {
		case 1:
			/* normal ina3221 presence detection, applied to detection */
			for (int i = 0; i<INA3221_NUM_VALS; i++) {
				if (0 == (detect2_bitfield & (1<<i))) continue;
				int p = (abs(ina_svalues[i])>1000) ? 1 : 0;
				if (p == presence[i]) continue;
				presence[i] = p;
				if (!p) continue;

				m.from = MA0_INA(oam_localBoardNum());
				m.to = MA1_CONTROL();
				m.cmd = CMD_DETECTION_REPORT;
				m.subc = i;
				m.v1 = ina_svalues[i];
				if ((0)) itm_debug2(DBG_DETECT, "report", i, ina_svalues[i]);
				mqf_write_from_ina3221(&m);
			}
			break;

		case 0:
			// ignore
			break;

		default:
			itm_debug2(DBG_ERR|DBG_DETECT|DBG_INA3221, "bad dmode", detect2_mode, detect2_bitfield);
			break;
		}
		break;


	case runmode_normal:
		for (int i = 0; i<INA3221_NUM_VALS; i++) {
			if ((i<=2)) itm_debug2(DBG_INA3221, "ina val", i, ina_svalues[i]);
#if 0
			int p = (abs(ina_svalues[i])>1000) ? 1 : 0;
			if (p == presence[i]) continue;
#else
			// hysteresis on detection
			int av = abs(ina_svalues[i]);
			int p;
			if (presence[i]) {
				if (av >= 300) continue;
				p = 0;
			} else {
				if (av <= 1000) continue;
				p = 1;
			}

#endif
			presence[i] = p;
			itm_debug3(DBG_INA3221|DBG_PRES, "PRSCH", i,p, ina_svalues[i]);
			// notify change
			m.from = MA0_INA(oam_localBoardNum()); // change to MA_INA3221_B ?
			m.to = MA1_CONTROL();
			m.cmd = CMD_PRESENCE_SUB_CHANGE;
			m.subc = i;
			m.v1u = p;
			m.v2 = ina_svalues[i];
			mqf_write_from_ina3221(&m);



			static int cnt=0;
			cnt++;
			if ((0) && ((cnt%50)==0)) {
				msg_64_t m;
				static int16_t v[12];
				memcpy(v, ina_svalues, 12*2);
				for (int i=0; i<12; i++) {
					if (abs(v[i]) > 400) {
						itm_debug2(DBG_INA3221, "ina big", i, v[i]);
					}
				}
				if ((1)) v[7] = cnt;
				m.from = MA0_INA(oam_localBoardNum());
				m.to = MA3_UI_GEN;
				m.cmd = CMD_INA3221_UI_REPORT;
				m.v32u = (uint32_t) v;
				mqf_write_from_ina3221(&m);
			}
			break;
		}
	}
}

// ---------------------------------------------------


void HAL_I2C_MemTxCpltCallback(_UNUSED_ I2C_HandleTypeDef *hi2c)
{
	BEGIN_ISR
	BaseType_t higher=0;
	xTaskNotifyFromISR(ina3221_taskHandle, NOTIF_INA_WRCOMPL, eSetBits, &higher);
	portYIELD_FROM_ISR(higher);
	END_ISR;
}

void HAL_I2C_MemRxCpltCallback(_UNUSED_ I2C_HandleTypeDef *hi2c)
{
	BEGIN_ISR
	BaseType_t higher=0;
	xTaskNotifyFromISR(ina3221_taskHandle, NOTIF_INA_RDCOMPL, eSetBits, &higher);
	portYIELD_FROM_ISR(higher);
	END_ISR;
}



void HAL_I2C_ErrorCallback(_UNUSED_ I2C_HandleTypeDef *hi2c)
{
	BEGIN_ISR
	lastErr = hi2c->ErrorCode;
	BaseType_t higher=0;
	xTaskNotifyFromISR(ina3221_taskHandle, NOTIF_INA_ERR, eSetBits, &higher);
	portYIELD_FROM_ISR(higher);
	END_ISR;
}


// ----------------------------------------------------------------------------------

#define INA_I2C_TIMEOUT  100

static uint16_t ina3221_read16(int a, int reg)
{
	HAL_StatusTypeDef status;
	uint16_t w16;
    status = HAL_I2C_Mem_Read(&INA3221_I2C_PORT, a<<1, reg, I2C_MEMADD_SIZE_8BIT, (uint8_t *)&w16, 2, INA_I2C_TIMEOUT);
    if (status != HAL_OK) {
    	itm_debug1(DBG_INA3221|DBG_ERR, "i2c r err", status);
    	ina3221_errors++;
    	bkpoint(1, INA3221_I2C_PORT.ErrorCode);
    	return 0;
    } else {
    	return __builtin_bswap16(w16);
    }
}

static int ina3221_write16(int a, int reg, uint16_t v)
{
	HAL_StatusTypeDef status;
	uint16_t w16;
	if ((1)) w16 = __builtin_bswap16(v);
	else w16=v;
    status = HAL_I2C_Mem_Write(&INA3221_I2C_PORT, a<<1, reg, I2C_MEMADD_SIZE_8BIT, (uint8_t *)&w16, 2, INA_I2C_TIMEOUT);
    if (status != HAL_OK) {
    	itm_debug1(DBG_INA3221|DBG_ERR, "i2c w err", status);
       	ina3221_errors++;
    	bkpoint(2, INA3221_I2C_PORT.ErrorCode);
    	return -1;
    }
    return 0;
}


// --------------------------------------------------------------------

