banyanshade-software/train_ctl_sw/trainctl/stm32/ina3221/ina3221.c
static uint8_t df_dev=0;
static uint8_t df_reg = 0;
static uint32_t df_t0 = 0;

#if FREQ_STORE_VAL

static uint16_t df_idx = 0;

typedef struct {
	uint32_t tick;
	int16_t val;
} time_val_t;

#define DF_NUMVAL (1024*2)
static time_val_t timeval[DF_NUMVAL] = {0};
#endif // FREQ_STORE_VAL

typedef struct freq_avg {
	int32_t sum;
	uint16_t n;
} freq_avg_t;

static freq_avg_t freqavg[FREQ_NSTEPS];
static int freq_st;
static int freq_idx;
static uint32_t freq_stoptick;
static uint32_t freq_starttick;

static void start_detectfreq_read(void)
{
	// mode 2 detection, detect2_bitfield is actually ina num
	df_dev = detect2_bitfield / 3;
	df_reg = detect2_bitfield % 3;
	itm_debug3(DBG_DETECT, "inafreq", detect2_bitfield, df_dev, df_reg);
	df_t0 = HAL_GetTick();
#if FREQ_STORE_VAL
	df_idx = 0;
	memset(timeval, 0, sizeof(timeval));
#endif
	memset(freqavg, 0, sizeof(freqavg));
	freq_st = 0;
	freq_idx = 0;
	freq_stoptick = 0;
	freq_starttick = 0;

	_reg_read(df_dev, df_reg);

}

static void df_complete(void);

static void handle_ina_notif_detectfreq(uint32_t notif)
{
	if (notif & NOTIF_INA_TRIG) {
	}
	if (notif & NOTIF_INA_WRCOMPL) {
	}
	if (notif & NOTIF_INA_READ) {
	}
	if (notif & NOTIF_INA_RDCOMPL) {
		uint32_t tick = HAL_GetTick();
		tick = tick - df_t0;
		//itm_debug3(DBG_INA3221|DBG_DETECT, "INA:N:CPL", tick, freq_st, freq_idx);
		int16_t val = (int16_t) __builtin_bswap16(ina_uvalues[df_dev*3+df_reg]);
		//itm_debug3(DBG_INA3221|DBG_DETECT, "rdcmpl", df_dev, df_reg, val);

		if (val<0) val = -val;

		switch (freq_st) {
		default:
		case -1:
			break;

		case 0:
			//waiting for begin
			if (val > 50) {
				freq_starttick = 0;
				freq_stoptick = tick+FREQ_FIRST_STEP_DUR-4;
				itm_debug2(DBG_DETECT, "xxx st0", 1, 0);
				freq_st = 1;
				freq_idx = 0;
			}
			break;
		case 1:
			if (tick >= freq_stoptick) {
				freq_idx++;
				if (freq_idx >= FREQ_NSTEPS) {
					itm_debug1(DBG_DETECT, "xxx done",0);
					freq_st = -1;
					df_complete();
					break;
				}
				itm_debug2(DBG_DETECT, "xxx st1", 2, freq_idx);
				freq_st = 2;
				freq_starttick = tick+FREQ_RELAX_TIME;
			} else {
				freqavg[freq_idx].sum += val;
				freqavg[freq_idx].n++;
			}
			break;
		case 2:
			if (tick >= freq_starttick) {
				freq_st = 1;
				freq_stoptick = tick+FREQ_STEP_DUR;
				itm_debug2(DBG_DETECT, "xxx st2", 1, freq_idx);
			}
			break;
		}

		if (freq_st>=0) {
			_reg_read(df_dev, df_reg);
		}
		//itm_debug3(DBG_DETECT, "inardf:", df_dev, df_reg, val /*ina_uvalues[df_dev*3+df_reg]*/);
		//itm_debug2(DBG_DETECT, "inardf:",df_idx, val );

#if FREQ_STORE_VAL

		if (df_idx < DF_NUMVAL) {
			timeval[df_idx].tick =  (uint16_t) tick;
			timeval[df_idx].val = val;
			df_idx++;

			if ((0)) { // debug/test, read all INAs regs
				static int c=0;
				df_dev = (c%12)/3;
				df_reg = c%3;
				c++;
			}

		} else {
			//df_complete();
		}
		if (df_idx==510) {
			itm_debug1(DBG_DETECT, "break here", 0);
		}
#endif // FREQ_STORE_VAL
	}
	if (notif & NOTIF_INA_ERR) {
		bkpoint(3, lastErr);
		if ((state >= state_rd_0) && (state <= state_rd_11)) {
			// write error
			// TODO
			state = state_idle;
		} else if ((state >= state_trig_0) && (state <= state_trig_3)) {
			// read error
			// TODO
			state = state_idle;
		} else {
			bkpoint(3,1000);
		}
		itm_debug1(DBG_INA3221|DBG_ERR, "i2c rst", lastErr);
		HAL_I2C_Init(&INA3221_I2C_PORT);
	}
}


// -------------------------------------------------------------------------------------------
// -------------------------------------------------------------------------------------------
// -------------------------------------------------------------------------------------------

// TODO: move loco somewhere else

typedef enum {
	loco_unknown = 0,
	Marklin8805_BR29,		// 1
	Marklin8821_V200,		// 2
	Marklin8895_BR74,		// 3
	Marklin8875_V160,		// 4
}  __attribute((packed)) locomotive_t;

typedef struct {
	locomotive_t loco;
	uint16_t k[8];
} kval_t;

#define NUM_VALK (14+24+7)
static _UNUSED_ const kval_t kvals[NUM_VALK+1] = {
{ Marklin8805_BR29, {856,   75, 57, 41, 14,  5,  2,  4}},		//0
{ Marklin8805_BR29, {633,   77, 68, 50, 26, 10,  4,  6}},
{ Marklin8805_BR29, {775,   70, 64, 45, 12,  2,  1,  2}},
{ Marklin8805_BR29, {538,   65, 54, 19,  4,  5,  6,  0}},
{ Marklin8805_BR29, {670,   85, 71, 53, 33, 12,  6,  6}},

{ Marklin8821_V200, {692,   88, 90, 59, 45, 23, 17, 17}},		//5
{ Marklin8821_V200, {761,   81, 67, 47, 32, 17, 17, 16}},
{ Marklin8821_V200, {788,   79, 67, 53, 33, 18, 13, 13}},

{ Marklin8895_BR74, {687,   93, 77, 60, 44, 20, 20, 19}},		//8
{ Marklin8895_BR74, {653,   82, 73, 59, 36, 21, 15, 14}},

{ Marklin8875_V160, {924,   76, 78, 62, 46, 29, 27, 24}},		//10
{ Marklin8875_V160, {882,   78, 75, 59, 50, 29, 28, 27}},
{ Marklin8875_V160, {916,	82, 72, 64, 45, 29, 25, 25}},
{ Marklin8875_V160, {787,   84, 82, 65, 47, 35, 31, 32}},

// second tests

{Marklin8821_V200,  {708,   76, 67, 51, 38, 19, 16, 15}},
{Marklin8821_V200,  {708,   84, 70, 54, 29, 15, 15, 13}},
{Marklin8821_V200,  {670,   94, 75, 62, 36, 23, 17, 17}},
{Marklin8821_V200,  {773,   79, 66, 50, 37, 18, 14, 17}},
{Marklin8821_V200,  {639,   82, 71, 56, 32, 23, 18, 19}},
{Marklin8821_V200,  {605,   78, 77, 59, 36, 23, 18, 18}},
{Marklin8821_V200,  {922,   78, 68, 51, 31, 16, 15, 14}},
{Marklin8821_V200,  {799,   94, 74, 61, 36, 19, 18, 17}},

{Marklin8875_V160,  {756,   88, 76, 65, 41, 39, 36, 35}},
{Marklin8875_V160,  {794,   88, 72, 67, 42, 37, 34, 32}},
{Marklin8875_V160,  {573,   82, 80, 78, 60, 44, 39, 36}},
{Marklin8875_V160,  {478,   83, 67, 54, 45, 34, 32, 34}},
{Marklin8875_V160,  {791,   80, 72, 66, 42, 33, 30, 29}},
{Marklin8875_V160,  {731,   85, 80, 72, 46, 39, 31, 30}},
{Marklin8875_V160,  {753,   79, 76, 66, 46, 38, 32, 30}},
{Marklin8875_V160,  {742,   85, 73, 64, 50, 38, 29, 31}},

{Marklin8805_BR29,  {892,   73, 51, 41, 18,  9,  6,  7}},
{Marklin8805_BR29,  {824,   80, 72, 47, 26, 10,  7,  8}},
{Marklin8805_BR29,  {804,   68, 56, 45, 24,  5,  2,  2}},
{Marklin8805_BR29,  {819,   81, 56, 51, 27,  9,  8,  5}},
{Marklin8805_BR29,  {948,   78, 60, 43, 20,  4,  3,  4}},
{Marklin8805_BR29,  {909,   79, 62, 41, 21,  5,  2,  2}},
{Marklin8805_BR29,  {949,   71, 66, 41, 21,  4,  2,  2}},
{Marklin8805_BR29,  {928,   89, 66, 48, 28, 10,  5,  5}},

{Marklin8895_BR74,  {635,    86, 75, 62, 38, 21, 20, 18}},
{Marklin8895_BR74,  {598,   79, 83, 67, 44, 21, 22, 22}},
{Marklin8895_BR74,  {482,   94, 54, 73, 49, 34, 26, 26}},
{Marklin8895_BR74,  {543,   85, 76, 72, 46, 28, 22, 20}},
{Marklin8895_BR74,  {731,   79, 68, 51, 34, 17, 17, 15}},
{Marklin8895_BR74,  {503,   82, 78, 63, 36, 13, 1,  1}},
{Marklin8895_BR74,  {477,   65, 16,  3,  3, 4,  0,  0}},


{loco_unknown,     {  0,    0,  0,  0,  0,  0,  0,  0}},
};


static const uint16_t coeff[8] = {1, 5, 10, 10, 10, 10, 10, 5};


