banyanshade-software/train_ctl_sw/trainctl/stm32/ina3221/ina3221.c
static void perform_knn(kval_t *pval);

static void df_complete(void)
{
	int32_t v0 = 0;
	kval_t kval = {0};
	int bad = 0;
	for (int i=0; i<FREQ_NSTEPS; i++) {
		int32_t k = 0;
		int32_t val = 0;
		if (freqavg[i].n) {
			if (!i) {
				v0 = freqavg[i].sum/freqavg[i].n;
				kval.k[0] = v0;
			}
			val = freqavg[i].sum/freqavg[i].n;
			if (i) {
				if (v0) {
					k = (100*val)/v0;
					kval.k[i] = k;
				}
			} else {
				k = 100;
			}
		} else {
			bad++;
		}
		itm_debug3(DBG_DETECT, "inafreq", i, val, k);

	}
	if (bad) {
		itm_debug1(DBG_DETECT, "bad freqd", 0);
	} else {
		perform_knn(&kval);
	}
#if FREQ_STORE_VAL
	for (int i=0; i<DF_NUMVAL; i++) {
		if (i && !timeval[i].tick) break;
		itm_debug3(DBG_DETECT, "inard", i, timeval[i].tick, timeval[i].val);
	}
#endif // FREQ_STORE_VAL
	itm_debug1(DBG_DETECT, "done inard", 0);
}


static inline uint32_t square(int32_t a)
{
	return a*a;
}

#define KNN_K_VALUE 4

static void perform_knn(kval_t *pval)
{
	static uint32_t dist[NUM_VALK];

	// distance with register samples
	memset(dist, 0, sizeof(dist));
	for (int i=0; i<NUM_VALK; i++) {
		int32_t d = 0;
		for (int k=0; k<8; k++) {
			d += square(pval->k[k] - kvals[i].k[k])*coeff[k];
		}
		itm_debug2(DBG_DETECT, "kNN dist", i, d);
		dist[i] = d;
	}
	// select k smallest distance
	// smarter alorithms : https://en.wikipedia.org/wiki/Selection_algorithm
	// we use a simple selection sort

	locomotive_t ksi[KNN_K_VALUE] = {0};
	uint16_t kdist[KNN_K_VALUE];
	for (int i=0; i<KNN_K_VALUE; i++) {
		uint32_t min_val = dist[0];
		int min_idx = 0;
		for (int k=1; k<NUM_VALK; k++) {
			if (dist[k] < min_val) {
				min_val = dist[k];
				min_idx = k;
			}
		}
		ksi[i] = kvals[min_idx].loco;
		kdist[i] = dist[min_idx];
		dist[min_idx]=0xFFFFFFFF;
	}
	// vote
	itm_debug3(DBG_DETECT, "vote?", ksi[0], ksi[1], ksi[2]);
	uint8_t v[KNN_K_VALUE];
	int maxv = -1;
	int maxi = 0;
	for (int i=0; i<KNN_K_VALUE; i++) {
		v[i]=1;
		for (int j=0; j<i; j++) {
			if (ksi[i]==ksi[j]) {
				if (kdist[j]<10000) v[j]+=2;
				else v[j]++;
				if(v[j]>maxv) {
					maxi = j;
					maxv = v[j];
				}
			}
		}
	}

	itm_debug3(DBG_DETECT, "vote!", maxi, maxv, ksi[maxi]);

	// report
	msg_64_t m = {0};
	m.from = MA0_INA(oam_localBoardNum());
	m.to = MA1_CONTROL();
	m.cmd = CMD_DETECTION_REPORT;
	m.subc = df_dev*3+df_reg;

	m.v1u = ksi[maxi];
	m.v2u = maxv;
	mqf_write_from_ina3221(&m);
}

